I-AM-ENGINEER/RNode_THalow_Firmware/sdkconfig.defaults
#
# sdkconfig.defaults - RNode-HaLow (ESP32-S3-WROOM-1 N16R8)
#
# Target is set via `idf.py set-target esp32s3`; this file only covers
# hardware/network settings. Full configuration via `idf.py menuconfig`.

# --- Target ---
CONFIG_IDF_TARGET="esp32s3"

# --- Flash: 16 MB, Quad I/O, 80 MHz ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# --- PSRAM: 8 MB, Octal (WROOM-1 N16R8) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# --- Partition table ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- lwIP / TCP ---
CONFIG_LWIP_TCP_ISN_HOOK=y

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- BLE (NimBLE) ---
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_MAX_BONDS=3
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_CCCDS=3
CONFIG_BT_NIMBLE_MAX_ATT_MTU=512
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y
